In [21]:
import csv
from rdflib import Graph, Literal, Namespace, URIRef
from rdflib.namespace import DCTERMS, RDF, RDFS, SKOS, XSD

In [22]:
Assigned_Hours=csv.DictReader(open('Assigned_Hours.csv'))
Course_Instances=csv.DictReader(open('Course_Instances.csv'))
Course_plannings=csv.DictReader(open('Course_plannings.csv'))
Courses=csv.DictReader(open('Courses.csv'))
Programme_Courses=csv.DictReader(open('Programme_Courses.csv'))
Programmes=csv.DictReader(open('Programmes.csv'))
Registrations=csv.DictReader(open('Registrations.csv'))
Reported_Hours=csv.DictReader(open('Reported_Hours.csv'))
Senior_Teachers=csv.DictReader(open('Senior_Teachers.csv'))
Students=csv.DictReader(open('Students.csv'))
Teaching_Assistants=csv.DictReader(open('Teaching_Assistants.csv'))

In [23]:
# mainDf=pd.DataFrame(columns=['subject','predicate','object'])

In [36]:
# make a graph
output_graph = Graph()


for row in Assigned_Hours:

    # convert it from an OrderedDict to a regular dict
    row = dict(row)

    #{'Subject Label': 'Pearl Wilmer Booker', 'Subject URI': 'None', 'Predicate Label': 'Daughter Of', 'Predicate URI': '', 'Predicate Symmetry': 'Asymmetric', 'Object Label': 'Mary Booker', 'Object URI': 'None'}
    # make a literal and add it
    output_graph.add(  (URIRef(row['Course code']), RDFS.label, Literal(row['Teacher Id'], lang='en')) )

    # make a triple with the object as uri
#     output_graph.add(  (URIRef(row['Subject URI']), URIRef(row['Predicate URI']), URIRef(row['Object URI'])) )	



# output_graph.serialize(format='turtle')
output_graph.serialize(destination='my_graph.nt', format='nt')

In [32]:
with open('rdfFiles//Assigned_Hours.ttl', 'wb') as file:
    file.write(ttl)

In [1]:
# print(output_graph.serialize(format='turtle').decode('UTF-8'))

In [37]:
import pandas as pd
import rdfpandas

In [38]:
Assigned_Hours=pd.read_csv('Assigned_Hours.csv')
Course_Instances=pd.read_csv('Course_Instances.csv')
Course_plannings=pd.read_csv('Course_plannings.csv')
Courses=pd.read_csv('Courses.csv')
Programme_Courses=pd.read_csv('Programme_Courses.csv')
Programmes=pd.read_csv('Programmes.csv')
Registrations=pd.read_csv('Registrations.csv')
Reported_Hours=pd.read_csv('Reported_Hours.csv')
Senior_Teachers=pd.read_csv('Senior_Teachers.csv')
Students=pd.read_csv('Students.csv')
Teaching_Assistants=pd.read_csv('Teaching_Assistants.csv')

In [39]:
Senior_Teachers.head()

  Teacher name     Teacher id Department name Division name
0    Teacher 1  19550711-0001              D1          D1-3
1    Teacher 2  19640131-0002              D3          D3-5
2    Teacher 3  19590109-0003              D7          D7-3
3    Teacher 4  19641017-0004              D1          D1-3
4    Teacher 5  19630316-0005              D5          D5-2

In [51]:
Teaching_Assistants.head()

  Teacher name     Teacher id Department name Division name
0       TA 151  19780321-0151              D1          D1-2
1       TA 152  19751107-0152              D7          D7-2
2       TA 153  19760106-0153              D7          D7-0
3       TA 154  19780210-0154              D6          D6-5
4       TA 155  19750330-0155              D1          D1-5

In [54]:
Teaching_Assistants= Teaching_Assistants.rename(columns={"Teacher name": "personName", "Teacher id": "personID", "Department name": "departmentName","Divison name": "divisionName"})

In [55]:
Teaching_Assistants.head()

  personName       personID departmentName Division name
0     TA 151  19780321-0151             D1          D1-2
1     TA 152  19751107-0152             D7          D7-2
2     TA 153  19760106-0153             D7          D7-0
3     TA 154  19780210-0154             D6          D6-5
4     TA 155  19750330-0155             D1          D1-5

In [57]:
#http://www.semanticweb.org/keyha/ontologies/2022/3/untitled-ontology-11#

# make a graph
output_graph = Graph()


for index, row in Teaching_Assistants.iterrows():

    # make a triple with the object as uri
#     output_graph.add(  ("http://www.semanticweb.org/keyha/ontologies/2022/3/untitled-ontology-11#"+row.personName,
#                         "http://www.semanticweb.org/keyha/ontologies/2022/3/untitled-ontology-11#personID",
#                         "http://www.semanticweb.org/keyha/ontologies/2022/3/untitled-ontology-11#"+row.personID) )
    
    
    output_graph.add(URIRef(row.personName), RDF.type , FOAF.person)

TypeError: add() takes 2 positional arguments but 4 were given

In [ ]:
for row in Assigned_Hours.iterrows()[:5]:
    print(row)

In [14]:
g = rdfpandas.to_graph(Course_Instances)
ttl = g.serialize(format = 'turtle')
with open('rdfFiles//Course_Instances.ttl', 'wb') as file:
    file.write(ttl)

In [27]:
# from csvwlib import CSVWConverter

# CSVWConverter.to_rdf(Course_plannings, format="ttl")